app/controllers/movies_controller.rb

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = 1  ORDER BY created_at DESC
---
  def show
    @reviews = Review.where(movie_id: @movie.id).order("created_at DESC")

INSERT INTO "movies" ("created_at", "description", "director", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "movie_length", "rating", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @movie = current_user.movies.build(movie_params)
    @movie.save