app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "rating", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comment", "Awesome movie!"], ["created_at", "2015-04-03 08:24:39.422140"], ["movie_id", 1], ["rating", 4], ["updated_at", "2015-04-03 08:24:39.422140"], ["user_id", 1]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id
    if @review.save